src/InformationRegisters/ar_ЗапрещённыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ЗапрещённыеОбъекты</Name>
			<Comment>Deny-list объектов базы данных, недоступных для изменения агентом. Проверяется L3.5 Guard в aosPermissionEngine.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонкретнаяСсылка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимЗапрета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_РежимЗапретаЗаписи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ar_РежимЗапретаЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_РежимЗапретаЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Любое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ar_ЗапрещённыеОбъекты/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Модуль менеджера регистра сведений ar_ЗапрещённыеОбъекты
// Deny-list объектов базы данных, недоступных для изменения агентом.
// Проверяется L3.5 Guard в ar_PermissionEngine (задача PERM-05).

#Область ПрограммныйИнтерфейс

// Записывает начальную запись самозащиты реестра запрещённых объектов.
// Идемпотентна: повторный вызов не создает дублей.
// Вызывается из ar_ToolDispatcher.ЗарегистрироватьВсеTools() (TOOL-17)
// или вручную при первом развертывании расширения.
//
// Формат ТипОбъекта: полное имя метаданных, например "Справочник.Контрагенты".
// Значение "*" означает "все типы".
//
// Пример:
//   РегистрыСведений.ar_ЗапрещённыеОбъекты.ЗаполнитьНачальноеЗаполнение();
//
Процедура ЗаполнитьНачальноеЗаполнение() Экспорт

	ЗащищенныйТипОбъекта = "РегистрСведений.ar_ЗапрещённыеОбъекты";
	РежимЗапретаЗначение = Перечисления.ar_РежимЗапретаЗаписи.Любое;

	// Привилегированный режим обязателен: запись выполняется от имени
	// сервисного кода без прав пользователя агента (std485).
	// Сохраняем исходное состояние для гарантированного восстановления.
	ИсходноеСостояниеПривРежима = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ЗаписатьЗащитнуюЗапись(ЗащищенныйТипОбъекта, РежимЗапретаЗначение);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ИсходноеСостояниеПривРежима);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Записывает защитную запись в регистр в транзакции с блокировкой.
// Параметры:
//   ТипОбъекта    - Строка - полное имя метаданных защищаемого объекта.
//                    Формат: "КлассМетаданных.ИмяОбъекта", напр. "Справочник.Контрагенты".
//   РежимЗапрета  - ПеречислениеСсылка.ar_РежимЗапретаЗаписи - режим блокировки.
//
Процедура ЗаписатьЗащитнуюЗапись(ТипОбъекта, РежимЗапрета)

	НачатьТранзакцию();
	Попытка

		// Ответственное чтение: блокируем конкретную запись перед чтением (std648).
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_ЗапрещённыеОбъекты");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ТипОбъекта", ТипОбъекта);
		ЭлементБлокировки.УстановитьЗначение("РежимЗапрета", РежимЗапрета);
		Блокировка.Заблокировать();

		// Проверка идемпотентности через запрос
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	1 КАК Признак
			|ИЗ
			|	РегистрСведений.ar_ЗапрещённыеОбъекты КАК ЗапрещённыеОбъекты
			|ГДЕ
			|	ЗапрещённыеОбъекты.ТипОбъекта = &ТипОбъекта
			|	И ЗапрещённыеОбъекты.РежимЗапрета = &РежимЗапрета";
		Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
		Запрос.УстановитьПараметр("РежимЗапрета", РежимЗапрета);

		Если Запрос.Выполнить().Пустой() Тогда
			// Запись не найдена - создаём новую через менеджер записи
			МенеджерЗаписи = РегистрыСведений.ar_ЗапрещённыеОбъекты.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ТипОбъекта   = ТипОбъекта;
			МенеджерЗаписи.РежимЗапрета = РежимЗапрета;
			МенеджерЗаписи.Включен  = Истина;
			МенеджерЗаписи.Причина  = НСтр(
				"ru = 'Системный объект AgentRunner: изменение агентами запрещено';
				|en = 'AgentRunner system object: modification by agents is prohibited'");
			МенеджерЗаписи.Записать();
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти
